# Pandas - Week 11

***

# Agregasi pada banyak kolom Data Frame dengan `agg()`

## Import modules

In [3]:
import pandas as pd

## Persiapan Data Frame

In [4]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## Menerapkan agregasi pada sejumlah kolom dengan `agg()`

In [7]:
df.groupby('pclass').agg({'pclass':'count', 
                           'age':['mean', 'max'], 
                          'survived':'mean'})

       pclass        age        survived
        count       mean   max      mean
pclass
1         323  39.159930  80.0  0.619195
2         277  29.506705  70.0  0.429603
3         709  24.816367  74.0  0.255289

Pada kode di atas, akan dilakukan pengelompokkan berdasarkan `pclass`. Setelahnya, digunakan fungsi `agg` yang akan menerima parameter berupa dictionary. **Key** dari dictionary tersebut menunjukkan kolom yang akan dikenakan fungsi agregasi, dan **Value**-nya menunjukkan fungsi agregasi apa yang akan digunakan untuk kolom tersebut.

Pada kasus ini, kolom `pclass` akan dikenakan fungsi agregasi `count`, kolom `age` akan dikenakan fungsi `mean` dan `max`, dan kolom `survived` akan dikenakan fungsi `mean`.

In [11]:
df.groupby('pclass').agg(n_pass=('pclass','count'), 
                           avg_age=('age', 'mean'),
                          max_age=('age', 'max'),
                          survival_rate=('survived','mean'))

        n_pass    avg_age  max_age  survival_rate
pclass
1          323  39.159930     80.0       0.619195
2          277  29.506705     70.0       0.429603
3          709  24.816367     74.0       0.255289

Kode di atas menunjukkan penggunaan nama kolom yang lebih representatif dengan nilai yang ditunjukkan. Method yang digunakan masih method `agg` dan dilanjutkan dengan menspesifikasikan parameternya dengan format berikut: `{nama kolom}=('nama_kolom', 'fungsi agregasi')`

***

# Mengurutkan data berdasarkan kolom tertentu

## Import modules

In [12]:
import pandas as pd

## Persiapan Data Frame

In [14]:
df = pd.read_csv('./data/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## Mengurutkan data berdasarkan kolom tertentu

Bisa dilakukan dengan menggunakan method `sort_values`.

In [15]:
df.sort_values('age').head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
763,3,1,"Dean, Miss. Elizabeth Gladys ""Millvina""",female,0.17,1,2,C.A. 2315,20.5750,NaN,S
747,3,0,"Danbom, Master. Gilbert Sigvard Emanuel",male,0.33,0,2,347080,14.4000,NaN,S
1240,3,1,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
427,2,1,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
1111,3,0,"Peacock, Master. Alfred Edward",male,0.75,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S

In [17]:
df.sort_values('age', ascending=False).head() # Menggunakan metode pengurutan secara descending.

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
61,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S
1235,3,0,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
135,1,0,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C

In [18]:
df.sort_values(['survived', 'age']).head() # Mengurutkan data pada 2 kolom.

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
747,3,0,"Danbom, Master. Gilbert Sigvard Emanuel",male,0.33,0,2,347080,14.4000,NaN,S
1111,3,0,"Peacock, Master. Alfred Edward",male,0.75,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
826,3,0,"Goodwin, Master. Sidney Leonard",male,1.00,5,2,CA 2144,46.9000,NaN,S
937,3,0,"Klasen, Miss. Gertrud Emilia",female,1.00,1,1,350405,12.1833,NaN,S
1101,3,0,"Panula, Master. Eino Viljami",male,1.00,4,1,3101295,39.6875,NaN,S

Penerapan nama kolom saat proses spesifikasi penting karena merepresentasikan urutan prioritasnya. Pada kode di atas, proses pengurutan akan dilakukan pada kolom `survived` terlebih dahulu dan dilanjutkan dengan kolom `age`.

***

# Menangani whitespace pada Pandas Data Frame

## Import modules

In [21]:
import pandas as pd
import numpy as np

## Persiapan Data Frame

In [22]:
data = {'nim':['10', '11', '12', '13', '  '],
       'nama':['adi', '  ', 'tejo', '  ', 'bejo']}

df = pd.DataFrame(data)
df

  nim  nama
0  10   adi
1  11
2  12  tejo
3  13
4      bejo

Pada data frame diatas, terdapat beberapa whitespace yang bisa menimbulkan permasalahan.

## Menangani whitespace pada Data Frame

In [23]:
df

  nim  nama
0  10   adi
1  11
2  12  tejo
3  13
4      bejo

In [24]:
df.info() # whitespace tidak terdeteksi sebagai null.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nim     5 non-null      object
 1   nama    5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

In [26]:
df = df.replace(r'^\s*$', np.nan, regex=True)
df

   nim  nama
0   10   adi
1   11   NaN
2   12  tejo
3   13   NaN
4  NaN  bejo

Untuk mengatasi masalah tersebut, dapat digunakan method `replace` dan dilanjutkan dengan menspesifikasikan tiga buah parameter. 

Parameter pertama adalah `regex (regular expression) pattern`  yang akan digunakan. Parameter kedua adalah nilai yang akan menggantikan, dan ketiga adalah pemberian nilai `True` pada `regex`.

In [27]:
df.info() # nilai null terdeteksi.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nim     4 non-null      object
 1   nama    3 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes